GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k40.inc
// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
T3CKIPPS                                 equ 0DF7h
// bitfield definitions
T3CKIPPS_PIN_POSN                        equ 0000h
T3CKIPPS_PIN_POSITION                    equ 0000h
T3CKIPPS_PIN_SIZE                        equ 0003h
T3CKIPPS_PIN_LENGTH                      equ 0003h
T3CKIPPS_PIN_MASK                        equ 0007h
T3CKIPPS_PORT_POSN                       equ 0003h
T3CKIPPS_PORT_POSITION                   equ 0003h
T3CKIPPS_PORT_SIZE                       equ 0002h
T3CKIPPS_PORT_LENGTH                     equ 0002h
T3CKIPPS_PORT_MASK                       equ 0018h
T3CKIPPS_T3CKIPPS_POSN                   equ 0000h
T3CKIPPS_T3CKIPPS_POSITION               equ 0000h
T3CKIPPS_T3CKIPPS_SIZE                   equ 0006h
T3CKIPPS_T3CKIPPS_LENGTH                 equ 0006h
T3CKIPPS_T3CKIPPS_MASK                   equ 003Fh
T3CKIPPS_T3CKIPPS0_POSN                  equ 0000h
T3CKIPPS_T3CKIPPS0_POSITION              equ 0000h
T3CKIPPS_T3CKIPPS0_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS0_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS0_MASK                  equ 0001h
T3CKIPPS_T3CKIPPS1_POSN                  equ 0001h
T3CKIPPS_T3CKIPPS1_POSITION              equ 0001h
T3CKIPPS_T3CKIPPS1_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS1_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS1_MASK                  equ 0002h
T3CKIPPS_T3CKIPPS2_POSN                  equ 0002h
T3CKIPPS_T3CKIPPS2_POSITION              equ 0002h
T3CKIPPS_T3CKIPPS2_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS2_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS2_MASK                  equ 0004h
T3CKIPPS_T3CKIPPS3_POSN                  equ 0003h
T3CKIPPS_T3CKIPPS3_POSITION              equ 0003h
T3CKIPPS_T3CKIPPS3_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS3_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS3_MASK                  equ 0008h
T3CKIPPS_T3CKIPPS4_POSN                  equ 0004h
T3CKIPPS_T3CKIPPS4_POSITION              equ 0004h
T3CKIPPS_T3CKIPPS4_SIZE                  equ 0001h
T3CKIPPS_T3CKIPPS4_LENGTH                equ 0001h
T3CKIPPS_T3CKIPPS4_MASK                  equ 0010h

// Register: T3GPPS
#define T3GPPS T3GPPS
T3GPPS                                   equ 0DF8h
// bitfield definitions
T3GPPS_PIN_POSN                          equ 0000h
T3GPPS_PIN_POSITION                      equ 0000h
T3GPPS_PIN_SIZE                          equ 0003h
T3GPPS_PIN_LENGTH                        equ 0003h
T3GPPS_PIN_MASK                          equ 0007h
T3GPPS_PORT_POSN                         equ 0003h
T3GPPS_PORT_POSITION                     equ 0003h
T3GPPS_PORT_SIZE                         equ 0002h
T3GPPS_PORT_LENGTH                       equ 0002h
T3GPPS_PORT_MASK                         equ 0018h
T3GPPS_T3GPPS_POSN                       equ 0000h
T3GPPS_T3GPPS_POSITION                   equ 0000h
T3GPPS_T3GPPS_SIZE                       equ 0006h
T3GPPS_T3GPPS_LENGTH                     equ 0006h
T3GPPS_T3GPPS_MASK                       equ 003Fh
T3GPPS_T3GPPS0_POSN                      equ 0000h
T3GPPS_T3GPPS0_POSITION                  equ 0000h
T3GPPS_T3GPPS0_SIZE                      equ 0001h
T3GPPS_T3GPPS0_LENGTH                    equ 0001h
T3GPPS_T3GPPS0_MASK                      equ 0001h
T3GPPS_T3GPPS1_POSN                      equ 0001h
T3GPPS_T3GPPS1_POSITION                  equ 0001h
T3GPPS_T3GPPS1_SIZE                      equ 0001h
T3GPPS_T3GPPS1_LENGTH                    equ 0001h
T3GPPS_T3GPPS1_MASK                      equ 0002h
T3GPPS_T3GPPS2_POSN                      equ 0002h
T3GPPS_T3GPPS2_POSITION                  equ 0002h
T3GPPS_T3GPPS2_SIZE                      equ 0001h
T3GPPS_T3GPPS2_LENGTH                    equ 0001h
T3GPPS_T3GPPS2_MASK                      equ 0004h
T3GPPS_T3GPPS3_POSN                      equ 0003h
T3GPPS_T3GPPS3_POSITION                  equ 0003h
T3GPPS_T3GPPS3_SIZE                      equ 0001h
T3GPPS_T3GPPS3_LENGTH                    equ 0001h
T3GPPS_T3GPPS3_MASK                      equ 0008h
T3GPPS_T3GPPS4_POSN                      equ 0004h
T3GPPS_T3GPPS4_POSITION                  equ 0004h
T3GPPS_T3GPPS4_SIZE                      equ 0001h
T3GPPS_T3GPPS4_LENGTH                    equ 0001h
T3GPPS_T3GPPS4_MASK                      equ 0010h

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
T5CKIPPS                                 equ 0DF9h
// bitfield definitions
T5CKIPPS_PIN_POSN                        equ 0000h
T5CKIPPS_PIN_POSITION                    equ 0000h
T5CKIPPS_PIN_SIZE                        equ 0003h
T5CKIPPS_PIN_LENGTH                      equ 0003h
T5CKIPPS_PIN_MASK                        equ 0007h
T5CKIPPS_PORT_POSN                       equ 0003h
T5CKIPPS_PORT_POSITION                   equ 0003h
T5CKIPPS_PORT_SIZE                       equ 0003h
T5CKIPPS_PORT_LENGTH                     equ 0003h
T5CKIPPS_PORT_MASK                       equ 0038h
T5CKIPPS_T5CKIPPS_POSN                   equ 0000h
T5CKIPPS_T5CKIPPS_POSITION               equ 0000h
T5CKIPPS_T5CKIPPS_SIZE                   equ 0006h
T5CKIPPS_T5CKIPPS_LENGTH                 equ 0006h
T5CKIPPS_T5CKIPPS_MASK                   equ 003Fh
T5CKIPPS_T5CKIPPS0_POSN                  equ 0000h
T5CKIPPS_T5CKIPPS0_POSITION              equ 0000h
T5CKIPPS_T5CKIPPS0_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS0_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS0_MASK                  equ 0001h
T5CKIPPS_T5CKIPPS1_POSN                  equ 0001h
T5CKIPPS_T5CKIPPS1_POSITION              equ 0001h
T5CKIPPS_T5CKIPPS1_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS1_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS1_MASK                  equ 0002h
T5CKIPPS_T5CKIPPS2_POSN                  equ 0002h
T5CKIPPS_T5CKIPPS2_POSITION              equ 0002h
T5CKIPPS_T5CKIPPS2_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS2_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS2_MASK                  equ 0004h
T5CKIPPS_T5CKIPPS3_POSN                  equ 0003h
T5CKIPPS_T5CKIPPS3_POSITION              equ 0003h
T5CKIPPS_T5CKIPPS3_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS3_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS3_MASK                  equ 0008h
T5CKIPPS_T5CKIPPS4_POSN                  equ 0004h
T5CKIPPS_T5CKIPPS4_POSITION              equ 0004h
T5CKIPPS_T5CKIPPS4_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS4_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS4_MASK                  equ 0010h
T5CKIPPS_T5CKIPPS5_POSN                  equ 0005h
T5CKIPPS_T5CKIPPS5_POSITION              equ 0005h
T5CKIPPS_T5CKIPPS5_SIZE                  equ 0001h
T5CKIPPS_T5CKIPPS5_LENGTH                equ 0001h
T5CKIPPS_T5CKIPPS5_MASK                  equ 0020h

// Register: T5GPPS
#define T5GPPS T5GPPS
T5GPPS                                   equ 0DFAh
// bitfield definitions
T5GPPS_PIN_POSN                          equ 0000h
T5GPPS_PIN_POSITION                      equ 0000h
T5GPPS_PIN_SIZE                          equ 0003h
T5GPPS_PIN_LENGTH                        equ 0003h
T5GPPS_PIN_MASK                          equ 0007h
T5GPPS_PORT_POSN                         equ 0003h
T5GPPS_PORT_POSITION                     equ 0003h
T5GPPS_PORT_SIZE                         equ 0003h
T5GPPS_PORT_LENGTH                       equ 0003h
T5GPPS_PORT_MASK                         equ 0038h
T5GPPS_T5GPPS_POSN                       equ 0000h
T5GPPS_T5GPPS_POSITION                   equ 0000h
T5GPPS_T5GPPS_SIZE                       equ 0006h
T5GPPS_T5GPPS_LENGTH                     equ 0006h
T5GPPS_T5GPPS_MASK                       equ 003Fh
T5GPPS_T5GPPS0_POSN                      equ 0000h
T5GPPS_T5GPPS0_POSITION                  equ 0000h
T5GPPS_T5GPPS0_SIZE                      equ 0001h
T5GPPS_T5GPPS0_LENGTH                    equ 0001h
T5GPPS_T5GPPS0_MASK                      equ 0001h
T5GPPS_T5GPPS1_POSN                      equ 0001h
T5GPPS_T5GPPS1_POSITION                  equ 0001h
T5GPPS_T5GPPS1_SIZE                      equ 0001h
T5GPPS_T5GPPS1_LENGTH                    equ 0001h
T5GPPS_T5GPPS1_MASK                      equ 0002h
T5GPPS_T5GPPS2_POSN                      equ 0002h
T5GPPS_T5GPPS2_POSITION                  equ 0002h
T5GPPS_T5GPPS2_SIZE                      equ 0001h
T5GPPS_T5GPPS2_LENGTH                    equ 0001h
T5GPPS_T5GPPS2_MASK                      equ 0004h
T5GPPS_T5GPPS3_POSN                      equ 0003h
T5GPPS_T5GPPS3_POSITION                  equ 0003h
T5GPPS_T5GPPS3_SIZE                      equ 0001h
T5GPPS_T5GPPS3_LENGTH                    equ 0001h
T5GPPS_T5GPPS3_MASK                      equ 0008h
T5GPPS_T5GPPS4_POSN                      equ 0004h
T5GPPS_T5GPPS4_POSITION                  equ 0004h
T5GPPS_T5GPPS4_SIZE                      equ 0001h
T5GPPS_T5GPPS4_LENGTH                    equ 0001h
T5GPPS_T5GPPS4_MASK                      equ 0010h
T5GPPS_T5GPPS5_POSN                      equ 0005h
T5GPPS_T5GPPS5_POSITION                  equ 0005h
T5GPPS_T5GPPS5_SIZE                      equ 0001h
T5GPPS_T5GPPS5_LENGTH                    equ 0001h
T5GPPS_T5GPPS5_MASK                      equ 0020h

// Register: T7CKIPPS
#define T7CKIPPS T7CKIPPS
T7CKIPPS                                 equ 0DFBh
// bitfield definitions
T7CKIPPS_PIN_POSN                        equ 0000h
T7CKIPPS_PIN_POSITION                    equ 0000h
T7CKIPPS_PIN_SIZE                        equ 0003h
T7CKIPPS_PIN_LENGTH                      equ 0003h
T7CKIPPS_PIN_MASK                        equ 0007h
T7CKIPPS_PORT_POSN                       equ 0003h
T7CKIPPS_PORT_POSITION                   equ 0003h
T7CKIPPS_PORT_SIZE                       equ 0003h
T7CKIPPS_PORT_LENGTH                     equ 0003h
T7CKIPPS_PORT_MASK                       equ 0038h
T7CKIPPS_T7CKIPPS_POSN                   equ 0000h
T7CKIPPS_T7CKIPPS_POSITION               equ 0000h
T7CKIPPS_T7CKIPPS_SIZE                   equ 0006h
T7CKIPPS_T7CKIPPS_LENGTH                 equ 0006h
T7CKIPPS_T7CKIPPS_MASK                   equ 003Fh
T7CKIPPS_T7CKIPPS0_POSN                  equ 0000h
T7CKIPPS_T7CKIPPS0_POSITION              equ 0000h
T7CKIPPS_T7CKIPPS0_SIZE                  equ 0001h
T7CKIPPS_T7CKIPPS0_LENGTH                equ 0001h
T7CKIPPS_T7CKIPPS0_MASK                  equ 0001h
T7CKIPPS_T7CKIPPS1_POSN                  equ 0001h
T7CKIPPS_T7CKIPPS1_POSITION              equ 0001h
T7CKIPPS_T7CKIPPS1_SIZE                  equ 0001h
T7CKIPPS_T7CKIPPS1_LENGTH                equ 0001h
T7CKIPPS_T7CKIPPS1_MASK                  equ 0002h
T7CKIPPS_T7CKIPPS2_POSN                  equ 0002h
T7CKIPPS_T7CKIPPS2_POSITION              equ 0002h
T7CKIPPS_T7CKIPPS2_SIZE                  equ 0001h
T7CKIPPS_T7CKIPPS2_LENGTH                equ 0001h
T7CKIPPS_T7CKIPPS2_MASK                  equ 0004h
T7CKIPPS_T7CKIPPS3_POSN                  equ 0003h
T7CKIPPS_T7CKIPPS3_POSITION              equ 0003h
T7CKIPPS_T7CKIPPS3_SIZE                  equ 0001h
T7CKIPPS_T7CKIPPS3_LENGTH                equ 0001h
T7CKIPPS_T7CKIPPS3_MASK                  equ 0008h
T7CKIPPS_T7CKIPPS4_POSN                  equ 0004h
T7CKIPPS_T7CKIPPS4_POSITION              equ 0004h
T7CKIPPS_T7CKIPPS4_SIZE                  equ 0001h
T7CKIPPS_T7CKIPPS4_LENGTH                equ 0001h
T7CKIPPS_T7CKIPPS4_MASK                  equ 0010h
T7CKIPPS_T7CKIPPS5_POSN                  equ 0005h
T7CKIPPS_T7CKIPPS5_POSITION              equ 0005h
T7CKIPPS_T7CKIPPS5_SIZE                  equ 0001h
T7CKIPPS_T7CKIPPS5_LENGTH                equ 0001h
T7CKIPPS_T7CKIPPS5_MASK                  equ 0020h

// Register: T7GPPS
#define T7GPPS T7GPPS
T7GPPS                                   equ 0DFCh
// bitfield definitions
T7GPPS_PIN_POSN                          equ 0000h
T7GPPS_PIN_POSITION                      equ 0000h
T7GPPS_PIN_SIZE                          equ 0003h
T7GPPS_PIN_LENGTH                        equ 0003h
T7GPPS_PIN_MASK                          equ 0007h
T7GPPS_PORT_POSN                         equ 0003h
T7GPPS_PORT_POSITION                     equ 0003h
T7GPPS_PORT_SIZE                         equ 0003h
T7GPPS_PORT_LENGTH                       equ 0003h
T7GPPS_PORT_MASK                         equ 0038h
T7GPPS_T7GPPS_POSN                       equ 0000h
T7GPPS_T7GPPS_POSITION                   equ 0000h
T7GPPS_T7GPPS_SIZE                       equ 0006h
T7GPPS_T7GPPS_LENGTH                     equ 0006h
T7GPPS_T7GPPS_MASK                       equ 003Fh
T7GPPS_T7GPPS0_POSN                      equ 0000h
T7GPPS_T7GPPS0_POSITION                  equ 0000h
T7GPPS_T7GPPS0_SIZE                      equ 0001h
T7GPPS_T7GPPS0_LENGTH                    equ 0001h
T7GPPS_T7GPPS0_MASK                      equ 0001h
T7GPPS_T7GPPS1_POSN                      equ 0001h
T7GPPS_T7GPPS1_POSITION                  equ 0001h
T7GPPS_T7GPPS1_SIZE                      equ 0001h
T7GPPS_T7GPPS1_LENGTH                    equ 0001h
T7GPPS_T7GPPS1_MASK                      equ 0002h
T7GPPS_T7GPPS2_POSN                      equ 0002h
T7GPPS_T7GPPS2_POSITION                  equ 0002h
T7GPPS_T7GPPS2_SIZE                      equ 0001h
T7GPPS_T7GPPS2_LENGTH                    equ 0001h
T7GPPS_T7GPPS2_MASK                      equ 0004h
T7GPPS_T7GPPS3_POSN                      equ 0003h
T7GPPS_T7GPPS3_POSITION                  equ 0003h
T7GPPS_T7GPPS3_SIZE                      equ 0001h
T7GPPS_T7GPPS3_LENGTH                    equ 0001h
T7GPPS_T7GPPS3_MASK                      equ 0008h
T7GPPS_T7GPPS4_POSN                      equ 0004h
T7GPPS_T7GPPS4_POSITION                  equ 0004h
T7GPPS_T7GPPS4_SIZE                      equ 0001h
T7GPPS_T7GPPS4_LENGTH                    equ 0001h
T7GPPS_T7GPPS4_MASK                      equ 0010h
T7GPPS_T7GPPS5_POSN                      equ 0005h
T7GPPS_T7GPPS5_POSITION                  equ 0005h
T7GPPS_T7GPPS5_SIZE                      equ 0001h
T7GPPS_T7GPPS5_LENGTH                    equ 0001h
T7GPPS_T7GPPS5_MASK                      equ 0020h

