GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k40.inc
// Register: ANSELE
#define ANSELE ANSELE
ANSELE                                   equ 0EAFh
// bitfield definitions
ANSELE_ANSELE0_POSN                      equ 0000h
ANSELE_ANSELE0_POSITION                  equ 0000h
ANSELE_ANSELE0_SIZE                      equ 0001h
ANSELE_ANSELE0_LENGTH                    equ 0001h
ANSELE_ANSELE0_MASK                      equ 0001h
ANSELE_ANSELE1_POSN                      equ 0001h
ANSELE_ANSELE1_POSITION                  equ 0001h
ANSELE_ANSELE1_SIZE                      equ 0001h
ANSELE_ANSELE1_LENGTH                    equ 0001h
ANSELE_ANSELE1_MASK                      equ 0002h
ANSELE_ANSELE2_POSN                      equ 0002h
ANSELE_ANSELE2_POSITION                  equ 0002h
ANSELE_ANSELE2_SIZE                      equ 0001h
ANSELE_ANSELE2_LENGTH                    equ 0001h
ANSELE_ANSELE2_MASK                      equ 0004h
ANSELE_ANSELE3_POSN                      equ 0003h
ANSELE_ANSELE3_POSITION                  equ 0003h
ANSELE_ANSELE3_SIZE                      equ 0001h
ANSELE_ANSELE3_LENGTH                    equ 0001h
ANSELE_ANSELE3_MASK                      equ 0008h
ANSELE_ANSELE4_POSN                      equ 0004h
ANSELE_ANSELE4_POSITION                  equ 0004h
ANSELE_ANSELE4_SIZE                      equ 0001h
ANSELE_ANSELE4_LENGTH                    equ 0001h
ANSELE_ANSELE4_MASK                      equ 0010h
ANSELE_ANSELE5_POSN                      equ 0005h
ANSELE_ANSELE5_POSITION                  equ 0005h
ANSELE_ANSELE5_SIZE                      equ 0001h
ANSELE_ANSELE5_LENGTH                    equ 0001h
ANSELE_ANSELE5_MASK                      equ 0020h
ANSELE_ANSELE6_POSN                      equ 0006h
ANSELE_ANSELE6_POSITION                  equ 0006h
ANSELE_ANSELE6_SIZE                      equ 0001h
ANSELE_ANSELE6_LENGTH                    equ 0001h
ANSELE_ANSELE6_MASK                      equ 0040h
ANSELE_ANSELE7_POSN                      equ 0007h
ANSELE_ANSELE7_POSITION                  equ 0007h
ANSELE_ANSELE7_SIZE                      equ 0001h
ANSELE_ANSELE7_LENGTH                    equ 0001h
ANSELE_ANSELE7_MASK                      equ 0080h

// Register: INLVLF
#define INLVLF INLVLF
INLVLF                                   equ 0EB0h
// bitfield definitions
INLVLF_INLVLF0_POSN                      equ 0000h
INLVLF_INLVLF0_POSITION                  equ 0000h
INLVLF_INLVLF0_SIZE                      equ 0001h
INLVLF_INLVLF0_LENGTH                    equ 0001h
INLVLF_INLVLF0_MASK                      equ 0001h
INLVLF_INLVLF1_POSN                      equ 0001h
INLVLF_INLVLF1_POSITION                  equ 0001h
INLVLF_INLVLF1_SIZE                      equ 0001h
INLVLF_INLVLF1_LENGTH                    equ 0001h
INLVLF_INLVLF1_MASK                      equ 0002h
INLVLF_INLVLF2_POSN                      equ 0002h
INLVLF_INLVLF2_POSITION                  equ 0002h
INLVLF_INLVLF2_SIZE                      equ 0001h
INLVLF_INLVLF2_LENGTH                    equ 0001h
INLVLF_INLVLF2_MASK                      equ 0004h
INLVLF_INLVLF3_POSN                      equ 0003h
INLVLF_INLVLF3_POSITION                  equ 0003h
INLVLF_INLVLF3_SIZE                      equ 0001h
INLVLF_INLVLF3_LENGTH                    equ 0001h
INLVLF_INLVLF3_MASK                      equ 0008h
INLVLF_INLVLF4_POSN                      equ 0004h
INLVLF_INLVLF4_POSITION                  equ 0004h
INLVLF_INLVLF4_SIZE                      equ 0001h
INLVLF_INLVLF4_LENGTH                    equ 0001h
INLVLF_INLVLF4_MASK                      equ 0010h
INLVLF_INLVLF5_POSN                      equ 0005h
INLVLF_INLVLF5_POSITION                  equ 0005h
INLVLF_INLVLF5_SIZE                      equ 0001h
INLVLF_INLVLF5_LENGTH                    equ 0001h
INLVLF_INLVLF5_MASK                      equ 0020h
INLVLF_INLVLF6_POSN                      equ 0006h
INLVLF_INLVLF6_POSITION                  equ 0006h
INLVLF_INLVLF6_SIZE                      equ 0001h
INLVLF_INLVLF6_LENGTH                    equ 0001h
INLVLF_INLVLF6_MASK                      equ 0040h
INLVLF_INLVLF7_POSN                      equ 0007h
INLVLF_INLVLF7_POSITION                  equ 0007h
INLVLF_INLVLF7_SIZE                      equ 0001h
INLVLF_INLVLF7_LENGTH                    equ 0001h
INLVLF_INLVLF7_MASK                      equ 0080h

// Register: SLRCONF
#define SLRCONF SLRCONF
SLRCONF                                  equ 0EB1h
// bitfield definitions
SLRCONF_SLRF0_POSN                       equ 0000h
SLRCONF_SLRF0_POSITION                   equ 0000h
SLRCONF_SLRF0_SIZE                       equ 0001h
SLRCONF_SLRF0_LENGTH                     equ 0001h
SLRCONF_SLRF0_MASK                       equ 0001h
SLRCONF_SLRF1_POSN                       equ 0001h
SLRCONF_SLRF1_POSITION                   equ 0001h
SLRCONF_SLRF1_SIZE                       equ 0001h
SLRCONF_SLRF1_LENGTH                     equ 0001h
SLRCONF_SLRF1_MASK                       equ 0002h
SLRCONF_SLRF2_POSN                       equ 0002h
SLRCONF_SLRF2_POSITION                   equ 0002h
SLRCONF_SLRF2_SIZE                       equ 0001h
SLRCONF_SLRF2_LENGTH                     equ 0001h
SLRCONF_SLRF2_MASK                       equ 0004h
SLRCONF_SLRF3_POSN                       equ 0003h
SLRCONF_SLRF3_POSITION                   equ 0003h
SLRCONF_SLRF3_SIZE                       equ 0001h
SLRCONF_SLRF3_LENGTH                     equ 0001h
SLRCONF_SLRF3_MASK                       equ 0008h
SLRCONF_SLRF4_POSN                       equ 0004h
SLRCONF_SLRF4_POSITION                   equ 0004h
SLRCONF_SLRF4_SIZE                       equ 0001h
SLRCONF_SLRF4_LENGTH                     equ 0001h
SLRCONF_SLRF4_MASK                       equ 0010h
SLRCONF_SLRF5_POSN                       equ 0005h
SLRCONF_SLRF5_POSITION                   equ 0005h
SLRCONF_SLRF5_SIZE                       equ 0001h
SLRCONF_SLRF5_LENGTH                     equ 0001h
SLRCONF_SLRF5_MASK                       equ 0020h
SLRCONF_SLRF6_POSN                       equ 0006h
SLRCONF_SLRF6_POSITION                   equ 0006h
SLRCONF_SLRF6_SIZE                       equ 0001h
SLRCONF_SLRF6_LENGTH                     equ 0001h
SLRCONF_SLRF6_MASK                       equ 0040h
SLRCONF_SLRF7_POSN                       equ 0007h
SLRCONF_SLRF7_POSITION                   equ 0007h
SLRCONF_SLRF7_SIZE                       equ 0001h
SLRCONF_SLRF7_LENGTH                     equ 0001h
SLRCONF_SLRF7_MASK                       equ 0080h

