GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k40.inc
// Register: ANSELG
#define ANSELG ANSELG
ANSELG                                   equ 0EBCh
// bitfield definitions
ANSELG_ANSELG0_POSN                      equ 0000h
ANSELG_ANSELG0_POSITION                  equ 0000h
ANSELG_ANSELG0_SIZE                      equ 0001h
ANSELG_ANSELG0_LENGTH                    equ 0001h
ANSELG_ANSELG0_MASK                      equ 0001h
ANSELG_ANSELG1_POSN                      equ 0001h
ANSELG_ANSELG1_POSITION                  equ 0001h
ANSELG_ANSELG1_SIZE                      equ 0001h
ANSELG_ANSELG1_LENGTH                    equ 0001h
ANSELG_ANSELG1_MASK                      equ 0002h
ANSELG_ANSELG2_POSN                      equ 0002h
ANSELG_ANSELG2_POSITION                  equ 0002h
ANSELG_ANSELG2_SIZE                      equ 0001h
ANSELG_ANSELG2_LENGTH                    equ 0001h
ANSELG_ANSELG2_MASK                      equ 0004h
ANSELG_ANSELG3_POSN                      equ 0003h
ANSELG_ANSELG3_POSITION                  equ 0003h
ANSELG_ANSELG3_SIZE                      equ 0001h
ANSELG_ANSELG3_LENGTH                    equ 0001h
ANSELG_ANSELG3_MASK                      equ 0008h
ANSELG_ANSELG4_POSN                      equ 0004h
ANSELG_ANSELG4_POSITION                  equ 0004h
ANSELG_ANSELG4_SIZE                      equ 0001h
ANSELG_ANSELG4_LENGTH                    equ 0001h
ANSELG_ANSELG4_MASK                      equ 0010h
ANSELG_ANSELG6_POSN                      equ 0006h
ANSELG_ANSELG6_POSITION                  equ 0006h
ANSELG_ANSELG6_SIZE                      equ 0001h
ANSELG_ANSELG6_LENGTH                    equ 0001h
ANSELG_ANSELG6_MASK                      equ 0040h
ANSELG_ANSELG7_POSN                      equ 0007h
ANSELG_ANSELG7_POSITION                  equ 0007h
ANSELG_ANSELG7_SIZE                      equ 0001h
ANSELG_ANSELG7_LENGTH                    equ 0001h
ANSELG_ANSELG7_MASK                      equ 0080h

// Register: INLVLH
#define INLVLH INLVLH
INLVLH                                   equ 0EBDh
// bitfield definitions
INLVLH_INLVLH0_POSN                      equ 0000h
INLVLH_INLVLH0_POSITION                  equ 0000h
INLVLH_INLVLH0_SIZE                      equ 0001h
INLVLH_INLVLH0_LENGTH                    equ 0001h
INLVLH_INLVLH0_MASK                      equ 0001h
INLVLH_INLVLH1_POSN                      equ 0001h
INLVLH_INLVLH1_POSITION                  equ 0001h
INLVLH_INLVLH1_SIZE                      equ 0001h
INLVLH_INLVLH1_LENGTH                    equ 0001h
INLVLH_INLVLH1_MASK                      equ 0002h
INLVLH_INLVLH2_POSN                      equ 0002h
INLVLH_INLVLH2_POSITION                  equ 0002h
INLVLH_INLVLH2_SIZE                      equ 0001h
INLVLH_INLVLH2_LENGTH                    equ 0001h
INLVLH_INLVLH2_MASK                      equ 0004h
INLVLH_INLVLH3_POSN                      equ 0003h
INLVLH_INLVLH3_POSITION                  equ 0003h
INLVLH_INLVLH3_SIZE                      equ 0001h
INLVLH_INLVLH3_LENGTH                    equ 0001h
INLVLH_INLVLH3_MASK                      equ 0008h

// Register: SLRCONH
#define SLRCONH SLRCONH
SLRCONH                                  equ 0EBEh
// bitfield definitions
SLRCONH_SLRH0_POSN                       equ 0000h
SLRCONH_SLRH0_POSITION                   equ 0000h
SLRCONH_SLRH0_SIZE                       equ 0001h
SLRCONH_SLRH0_LENGTH                     equ 0001h
SLRCONH_SLRH0_MASK                       equ 0001h
SLRCONH_SLRH1_POSN                       equ 0001h
SLRCONH_SLRH1_POSITION                   equ 0001h
SLRCONH_SLRH1_SIZE                       equ 0001h
SLRCONH_SLRH1_LENGTH                     equ 0001h
SLRCONH_SLRH1_MASK                       equ 0002h
SLRCONH_SLRH2_POSN                       equ 0002h
SLRCONH_SLRH2_POSITION                   equ 0002h
SLRCONH_SLRH2_SIZE                       equ 0001h
SLRCONH_SLRH2_LENGTH                     equ 0001h
SLRCONH_SLRH2_MASK                       equ 0004h
SLRCONH_SLRH3_POSN                       equ 0003h
SLRCONH_SLRH3_POSITION                   equ 0003h
SLRCONH_SLRH3_SIZE                       equ 0001h
SLRCONH_SLRH3_LENGTH                     equ 0001h
SLRCONH_SLRH3_MASK                       equ 0008h

// Register: ODCONH
#define ODCONH ODCONH
ODCONH                                   equ 0EBFh
// bitfield definitions
ODCONH_ODCH0_POSN                        equ 0000h
ODCONH_ODCH0_POSITION                    equ 0000h
ODCONH_ODCH0_SIZE                        equ 0001h
ODCONH_ODCH0_LENGTH                      equ 0001h
ODCONH_ODCH0_MASK                        equ 0001h
ODCONH_ODCH1_POSN                        equ 0001h
ODCONH_ODCH1_POSITION                    equ 0001h
ODCONH_ODCH1_SIZE                        equ 0001h
ODCONH_ODCH1_LENGTH                      equ 0001h
ODCONH_ODCH1_MASK                        equ 0002h
ODCONH_ODCH2_POSN                        equ 0002h
ODCONH_ODCH2_POSITION                    equ 0002h
ODCONH_ODCH2_SIZE                        equ 0001h
ODCONH_ODCH2_LENGTH                      equ 0001h
ODCONH_ODCH2_MASK                        equ 0004h
ODCONH_ODCH3_POSN                        equ 0003h
ODCONH_ODCH3_POSITION                    equ 0003h
ODCONH_ODCH3_SIZE                        equ 0001h
ODCONH_ODCH3_LENGTH                      equ 0001h
ODCONH_ODCH3_MASK                        equ 0008h

// Register: WPUH
#define WPUH WPUH
WPUH                                     equ 0EC0h
// bitfield definitions
WPUH_WPUH0_POSN                          equ 0000h
WPUH_WPUH0_POSITION                      equ 0000h
WPUH_WPUH0_SIZE                          equ 0001h
WPUH_WPUH0_LENGTH                        equ 0001h
WPUH_WPUH0_MASK                          equ 0001h
WPUH_WPUH1_POSN                          equ 0001h
WPUH_WPUH1_POSITION                      equ 0001h
WPUH_WPUH1_SIZE                          equ 0001h
WPUH_WPUH1_LENGTH                        equ 0001h
WPUH_WPUH1_MASK                          equ 0002h
WPUH_WPUH2_POSN                          equ 0002h
WPUH_WPUH2_POSITION                      equ 0002h
WPUH_WPUH2_SIZE                          equ 0001h
WPUH_WPUH2_LENGTH                        equ 0001h
WPUH_WPUH2_MASK                          equ 0004h
WPUH_WPUH3_POSN                          equ 0003h
WPUH_WPUH3_POSITION                      equ 0003h
WPUH_WPUH3_SIZE                          equ 0001h
WPUH_WPUH3_LENGTH                        equ 0001h
WPUH_WPUH3_MASK                          equ 0008h

// Register: HLVDCON0
#define HLVDCON0 HLVDCON0
HLVDCON0                                 equ 0EC2h
// bitfield definitions
HLVDCON0_INTL_POSN                       equ 0000h
HLVDCON0_INTL_POSITION                   equ 0000h
HLVDCON0_INTL_SIZE                       equ 0001h
HLVDCON0_INTL_LENGTH                     equ 0001h
HLVDCON0_INTL_MASK                       equ 0001h
HLVDCON0_INTH_POSN                       equ 0001h
HLVDCON0_INTH_POSITION                   equ 0001h
HLVDCON0_INTH_SIZE                       equ 0001h
HLVDCON0_INTH_LENGTH                     equ 0001h
HLVDCON0_INTH_MASK                       equ 0002h
HLVDCON0_RDY_POSN                        equ 0004h
HLVDCON0_RDY_POSITION                    equ 0004h
HLVDCON0_RDY_SIZE                        equ 0001h
HLVDCON0_RDY_LENGTH                      equ 0001h
HLVDCON0_RDY_MASK                        equ 0010h
HLVDCON0_OUT_POSN                        equ 0005h
HLVDCON0_OUT_POSITION                    equ 0005h
HLVDCON0_OUT_SIZE                        equ 0001h
HLVDCON0_OUT_LENGTH                      equ 0001h
HLVDCON0_OUT_MASK                        equ 0020h
HLVDCON0_EN_POSN                         equ 0007h
HLVDCON0_EN_POSITION                     equ 0007h
HLVDCON0_EN_SIZE                         equ 0001h
HLVDCON0_EN_LENGTH                       equ 0001h
HLVDCON0_EN_MASK                         equ 0080h
HLVDCON0_HLVDINTL_POSN                   equ 0000h
HLVDCON0_HLVDINTL_POSITION               equ 0000h
HLVDCON0_HLVDINTL_SIZE                   equ 0001h
HLVDCON0_HLVDINTL_LENGTH                 equ 0001h
HLVDCON0_HLVDINTL_MASK                   equ 0001h
HLVDCON0_HLVDINTH_POSN                   equ 0001h
HLVDCON0_HLVDINTH_POSITION               equ 0001h
HLVDCON0_HLVDINTH_SIZE                   equ 0001h
HLVDCON0_HLVDINTH_LENGTH                 equ 0001h
HLVDCON0_HLVDINTH_MASK                   equ 0002h
HLVDCON0_HLVDRDY_POSN                    equ 0004h
HLVDCON0_HLVDRDY_POSITION                equ 0004h
HLVDCON0_HLVDRDY_SIZE                    equ 0001h
HLVDCON0_HLVDRDY_LENGTH                  equ 0001h
HLVDCON0_HLVDRDY_MASK                    equ 0010h
HLVDCON0_HLVDOUT_POSN                    equ 0005h
HLVDCON0_HLVDOUT_POSITION                equ 0005h
HLVDCON0_HLVDOUT_SIZE                    equ 0001h
HLVDCON0_HLVDOUT_LENGTH                  equ 0001h
HLVDCON0_HLVDOUT_MASK                    equ 0020h
HLVDCON0_HLVDEN_POSN                     equ 0007h
HLVDCON0_HLVDEN_POSITION                 equ 0007h
HLVDCON0_HLVDEN_SIZE                     equ 0001h
HLVDCON0_HLVDEN_LENGTH                   equ 0001h
HLVDCON0_HLVDEN_MASK                     equ 0080h

// Register: HLVDCON1
#define HLVDCON1 HLVDCON1
HLVDCON1                                 equ 0EC3h
// bitfield definitions
HLVDCON1_SEL_POSN                        equ 0000h
HLVDCON1_SEL_POSITION                    equ 0000h
HLVDCON1_SEL_SIZE                        equ 0004h
HLVDCON1_SEL_LENGTH                      equ 0004h
HLVDCON1_SEL_MASK                        equ 000Fh
HLVDCON1_SEL0_POSN                       equ 0000h
HLVDCON1_SEL0_POSITION                   equ 0000h
HLVDCON1_SEL0_SIZE                       equ 0001h
HLVDCON1_SEL0_LENGTH                     equ 0001h
HLVDCON1_SEL0_MASK                       equ 0001h
HLVDCON1_SEL1_POSN                       equ 0001h
HLVDCON1_SEL1_POSITION                   equ 0001h
HLVDCON1_SEL1_SIZE                       equ 0001h
HLVDCON1_SEL1_LENGTH                     equ 0001h
HLVDCON1_SEL1_MASK                       equ 0002h
HLVDCON1_SEL2_POSN                       equ 0002h
HLVDCON1_SEL2_POSITION                   equ 0002h
HLVDCON1_SEL2_SIZE                       equ 0001h
HLVDCON1_SEL2_LENGTH                     equ 0001h
HLVDCON1_SEL2_MASK                       equ 0004h
HLVDCON1_SEL3_POSN                       equ 0003h
HLVDCON1_SEL3_POSITION                   equ 0003h
HLVDCON1_SEL3_SIZE                       equ 0001h
HLVDCON1_SEL3_LENGTH                     equ 0001h
HLVDCON1_SEL3_MASK                       equ 0008h
HLVDCON1_HLVDSEL0_POSN                   equ 0000h
HLVDCON1_HLVDSEL0_POSITION               equ 0000h
HLVDCON1_HLVDSEL0_SIZE                   equ 0001h
HLVDCON1_HLVDSEL0_LENGTH                 equ 0001h
HLVDCON1_HLVDSEL0_MASK                   equ 0001h
HLVDCON1_HLVDSEL1_POSN                   equ 0001h
HLVDCON1_HLVDSEL1_POSITION               equ 0001h
HLVDCON1_HLVDSEL1_SIZE                   equ 0001h
HLVDCON1_HLVDSEL1_LENGTH                 equ 0001h
HLVDCON1_HLVDSEL1_MASK                   equ 0002h
HLVDCON1_HLVDSEL2_POSN                   equ 0002h
HLVDCON1_HLVDSEL2_POSITION               equ 0002h
HLVDCON1_HLVDSEL2_SIZE                   equ 0001h
HLVDCON1_HLVDSEL2_LENGTH                 equ 0001h
HLVDCON1_HLVDSEL2_MASK                   equ 0004h
HLVDCON1_HLVDSEL3_POSN                   equ 0003h
HLVDCON1_HLVDSEL3_POSITION               equ 0003h
HLVDCON1_HLVDSEL3_SIZE                   equ 0001h
HLVDCON1_HLVDSEL3_LENGTH                 equ 0001h
HLVDCON1_HLVDSEL3_MASK                   equ 0008h

// Register: FVRCON
#define FVRCON FVRCON
FVRCON                                   equ 0EC4h
// bitfield definitions
FVRCON_ADFVR_POSN                        equ 0000h
FVRCON_ADFVR_POSITION                    equ 0000h
FVRCON_ADFVR_SIZE                        equ 0002h
FVRCON_ADFVR_LENGTH                      equ 0002h
FVRCON_ADFVR_MASK                        equ 0003h
FVRCON_CDAFVR_POSN                       equ 0002h
FVRCON_CDAFVR_POSITION                   equ 0002h
FVRCON_CDAFVR_SIZE                       equ 0002h
FVRCON_CDAFVR_LENGTH                     equ 0002h
FVRCON_CDAFVR_MASK                       equ 000Ch
FVRCON_TSRNG_POSN                        equ 0004h
FVRCON_TSRNG_POSITION                    equ 0004h
FVRCON_TSRNG_SIZE                        equ 0001h
FVRCON_TSRNG_LENGTH                      equ 0001h
FVRCON_TSRNG_MASK                        equ 0010h
FVRCON_TSEN_POSN                         equ 0005h
FVRCON_TSEN_POSITION                     equ 0005h
FVRCON_TSEN_SIZE                         equ 0001h
FVRCON_TSEN_LENGTH                       equ 0001h
FVRCON_TSEN_MASK                         equ 0020h
FVRCON_RDY_POSN                          equ 0006h
FVRCON_RDY_POSITION                      equ 0006h
FVRCON_RDY_SIZE                          equ 0001h
FVRCON_RDY_LENGTH                        equ 0001h
FVRCON_RDY_MASK                          equ 0040h
FVRCON_EN_POSN                           equ 0007h
FVRCON_EN_POSITION                       equ 0007h
FVRCON_EN_SIZE                           equ 0001h
FVRCON_EN_LENGTH                         equ 0001h
FVRCON_EN_MASK                           equ 0080h
FVRCON_ADFVR0_POSN                       equ 0000h
FVRCON_ADFVR0_POSITION                   equ 0000h
FVRCON_ADFVR0_SIZE                       equ 0001h
FVRCON_ADFVR0_LENGTH                     equ 0001h
FVRCON_ADFVR0_MASK                       equ 0001h
FVRCON_ADFVR1_POSN                       equ 0001h
FVRCON_ADFVR1_POSITION                   equ 0001h
FVRCON_ADFVR1_SIZE                       equ 0001h
FVRCON_ADFVR1_LENGTH                     equ 0001h
FVRCON_ADFVR1_MASK                       equ 0002h
FVRCON_CDAFVR0_POSN                      equ 0002h
FVRCON_CDAFVR0_POSITION                  equ 0002h
FVRCON_CDAFVR0_SIZE                      equ 0001h
FVRCON_CDAFVR0_LENGTH                    equ 0001h
FVRCON_CDAFVR0_MASK                      equ 0004h
FVRCON_CDAFVR1_POSN                      equ 0003h
FVRCON_CDAFVR1_POSITION                  equ 0003h
FVRCON_CDAFVR1_SIZE                      equ 0001h
FVRCON_CDAFVR1_LENGTH                    equ 0001h
FVRCON_CDAFVR1_MASK                      equ 0008h
FVRCON_FVRRDY_POSN                       equ 0006h
FVRCON_FVRRDY_POSITION                   equ 0006h
FVRCON_FVRRDY_SIZE                       equ 0001h
FVRCON_FVRRDY_LENGTH                     equ 0001h
FVRCON_FVRRDY_MASK                       equ 0040h
FVRCON_FVREN_POSN                        equ 0007h
FVRCON_FVREN_POSITION                    equ 0007h
FVRCON_FVREN_SIZE                        equ 0001h
FVRCON_FVREN_LENGTH                      equ 0001h
FVRCON_FVREN_MASK                        equ 0080h

// Register: ZCDCON
#define ZCDCON ZCDCON
ZCDCON                                   equ 0EC5h
// bitfield definitions
ZCDCON_INTN_POSN                         equ 0000h
ZCDCON_INTN_POSITION                     equ 0000h
ZCDCON_INTN_SIZE                         equ 0001h
ZCDCON_INTN_LENGTH                       equ 0001h
ZCDCON_INTN_MASK                         equ 0001h
ZCDCON_INTP_POSN                         equ 0001h
ZCDCON_INTP_POSITION                     equ 0001h
ZCDCON_INTP_SIZE                         equ 0001h
ZCDCON_INTP_LENGTH                       equ 0001h
ZCDCON_INTP_MASK                         equ 0002h
ZCDCON_POL_POSN                          equ 0004h
ZCDCON_POL_POSITION                      equ 0004h
ZCDCON_POL_SIZE                          equ 0001h
ZCDCON_POL_LENGTH                        equ 0001h
ZCDCON_POL_MASK                          equ 0010h
ZCDCON_OUT_POSN                          equ 0005h
ZCDCON_OUT_POSITION                      equ 0005h
ZCDCON_OUT_SIZE                          equ 0001h
ZCDCON_OUT_LENGTH                        equ 0001h
ZCDCON_OUT_MASK                          equ 0020h
ZCDCON_SEN_POSN                          equ 0007h
ZCDCON_SEN_POSITION                      equ 0007h
ZCDCON_SEN_SIZE                          equ 0001h
ZCDCON_SEN_LENGTH                        equ 0001h
ZCDCON_SEN_MASK                          equ 0080h
ZCDCON_ZCDINTN_POSN                      equ 0000h
ZCDCON_ZCDINTN_POSITION                  equ 0000h
ZCDCON_ZCDINTN_SIZE                      equ 0001h
ZCDCON_ZCDINTN_LENGTH                    equ 0001h
ZCDCON_ZCDINTN_MASK                      equ 0001h
ZCDCON_ZCDINTP_POSN                      equ 0001h
ZCDCON_ZCDINTP_POSITION                  equ 0001h
ZCDCON_ZCDINTP_SIZE                      equ 0001h
ZCDCON_ZCDINTP_LENGTH                    equ 0001h
ZCDCON_ZCDINTP_MASK                      equ 0002h
ZCDCON_ZCDPOL_POSN                       equ 0004h
ZCDCON_ZCDPOL_POSITION                   equ 0004h
ZCDCON_ZCDPOL_SIZE                       equ 0001h
ZCDCON_ZCDPOL_LENGTH                     equ 0001h
ZCDCON_ZCDPOL_MASK                       equ 0010h
ZCDCON_ZCDOUT_POSN                       equ 0005h
ZCDCON_ZCDOUT_POSITION                   equ 0005h
ZCDCON_ZCDOUT_SIZE                       equ 0001h
ZCDCON_ZCDOUT_LENGTH                     equ 0001h
ZCDCON_ZCDOUT_MASK                       equ 0020h
ZCDCON_ZCDSEN_POSN                       equ 0007h
ZCDCON_ZCDSEN_POSITION                   equ 0007h
ZCDCON_ZCDSEN_SIZE                       equ 0001h
ZCDCON_ZCDSEN_LENGTH                     equ 0001h
ZCDCON_ZCDSEN_MASK                       equ 0080h

// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
DAC1CON0                                 equ 0EC6h
// bitfield definitions
DAC1CON0_NSS_POSN                        equ 0000h
DAC1CON0_NSS_POSITION                    equ 0000h
DAC1CON0_NSS_SIZE                        equ 0001h
DAC1CON0_NSS_LENGTH                      equ 0001h
DAC1CON0_NSS_MASK                        equ 0001h
DAC1CON0_PSS_POSN                        equ 0002h
DAC1CON0_PSS_POSITION                    equ 0002h
DAC1CON0_PSS_SIZE                        equ 0002h
DAC1CON0_PSS_LENGTH                      equ 0002h
DAC1CON0_PSS_MASK                        equ 000Ch
DAC1CON0_OE2_POSN                        equ 0004h
DAC1CON0_OE2_POSITION                    equ 0004h
DAC1CON0_OE2_SIZE                        equ 0001h
DAC1CON0_OE2_LENGTH                      equ 0001h
DAC1CON0_OE2_MASK                        equ 0010h
DAC1CON0_OE1_POSN                        equ 0005h
DAC1CON0_OE1_POSITION                    equ 0005h
DAC1CON0_OE1_SIZE                        equ 0001h
DAC1CON0_OE1_LENGTH                      equ 0001h
DAC1CON0_OE1_MASK                        equ 0020h
DAC1CON0_EN_POSN                         equ 0007h
DAC1CON0_EN_POSITION                     equ 0007h
DAC1CON0_EN_SIZE                         equ 0001h
DAC1CON0_EN_LENGTH                       equ 0001h
DAC1CON0_EN_MASK                         equ 0080h
DAC1CON0_DAC1NSS_POSN                    equ 0000h
DAC1CON0_DAC1NSS_POSITION                equ 0000h
DAC1CON0_DAC1NSS_SIZE                    equ 0001h
DAC1CON0_DAC1NSS_LENGTH                  equ 0001h
DAC1CON0_DAC1NSS_MASK                    equ 0001h
DAC1CON0_DAC1PSS0_POSN                   equ 0002h
DAC1CON0_DAC1PSS0_POSITION               equ 0002h
DAC1CON0_DAC1PSS0_SIZE                   equ 0001h
DAC1CON0_DAC1PSS0_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS0_MASK                   equ 0004h
DAC1CON0_DAC1PSS1_POSN                   equ 0003h
DAC1CON0_DAC1PSS1_POSITION               equ 0003h
DAC1CON0_DAC1PSS1_SIZE                   equ 0001h
DAC1CON0_DAC1PSS1_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS1_MASK                   equ 0008h
DAC1CON0_DAC1OE2_POSN                    equ 0004h
DAC1CON0_DAC1OE2_POSITION                equ 0004h
DAC1CON0_DAC1OE2_SIZE                    equ 0001h
DAC1CON0_DAC1OE2_LENGTH                  equ 0001h
DAC1CON0_DAC1OE2_MASK                    equ 0010h
DAC1CON0_DAC1OE1_POSN                    equ 0005h
DAC1CON0_DAC1OE1_POSITION                equ 0005h
DAC1CON0_DAC1OE1_SIZE                    equ 0001h
DAC1CON0_DAC1OE1_LENGTH                  equ 0001h
DAC1CON0_DAC1OE1_MASK                    equ 0020h
DAC1CON0_DAC1EN_POSN                     equ 0007h
DAC1CON0_DAC1EN_POSITION                 equ 0007h
DAC1CON0_DAC1EN_SIZE                     equ 0001h
DAC1CON0_DAC1EN_LENGTH                   equ 0001h
DAC1CON0_DAC1EN_MASK                     equ 0080h
DAC1CON0_PSS0_POSN                       equ 0002h
DAC1CON0_PSS0_POSITION                   equ 0002h
DAC1CON0_PSS0_SIZE                       equ 0001h
DAC1CON0_PSS0_LENGTH                     equ 0001h
DAC1CON0_PSS0_MASK                       equ 0004h
DAC1CON0_PSS1_POSN                       equ 0003h
DAC1CON0_PSS1_POSITION                   equ 0003h
DAC1CON0_PSS1_SIZE                       equ 0001h
DAC1CON0_PSS1_LENGTH                     equ 0001h
DAC1CON0_PSS1_MASK                       equ 0008h

// Register: DAC1CON1
#define DAC1CON1 DAC1CON1
DAC1CON1                                 equ 0EC7h
// bitfield definitions
DAC1CON1_DAC1R_POSN                      equ 0000h
DAC1CON1_DAC1R_POSITION                  equ 0000h
DAC1CON1_DAC1R_SIZE                      equ 0005h
DAC1CON1_DAC1R_LENGTH                    equ 0005h
DAC1CON1_DAC1R_MASK                      equ 001Fh
DAC1CON1_DAC1R0_POSN                     equ 0000h
DAC1CON1_DAC1R0_POSITION                 equ 0000h
DAC1CON1_DAC1R0_SIZE                     equ 0001h
DAC1CON1_DAC1R0_LENGTH                   equ 0001h
DAC1CON1_DAC1R0_MASK                     equ 0001h
DAC1CON1_DAC1R1_POSN                     equ 0001h
DAC1CON1_DAC1R1_POSITION                 equ 0001h
DAC1CON1_DAC1R1_SIZE                     equ 0001h
DAC1CON1_DAC1R1_LENGTH                   equ 0001h
DAC1CON1_DAC1R1_MASK                     equ 0002h
DAC1CON1_DAC1R2_POSN                     equ 0002h
DAC1CON1_DAC1R2_POSITION                 equ 0002h
DAC1CON1_DAC1R2_SIZE                     equ 0001h
DAC1CON1_DAC1R2_LENGTH                   equ 0001h
DAC1CON1_DAC1R2_MASK                     equ 0004h
DAC1CON1_DAC1R3_POSN                     equ 0003h
DAC1CON1_DAC1R3_POSITION                 equ 0003h
DAC1CON1_DAC1R3_SIZE                     equ 0001h
DAC1CON1_DAC1R3_LENGTH                   equ 0001h
DAC1CON1_DAC1R3_MASK                     equ 0008h
DAC1CON1_DAC1R4_POSN                     equ 0004h
DAC1CON1_DAC1R4_POSITION                 equ 0004h
DAC1CON1_DAC1R4_SIZE                     equ 0001h
DAC1CON1_DAC1R4_LENGTH                   equ 0001h
DAC1CON1_DAC1R4_MASK                     equ 0010h

