GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k40.inc
// Register: SP5BRGL
#define SP5BRGL SP5BRGL
SP5BRGL                                  equ 0EDEh
// bitfield definitions
SP5BRGL_SP5BRGL_POSN                     equ 0000h
SP5BRGL_SP5BRGL_POSITION                 equ 0000h
SP5BRGL_SP5BRGL_SIZE                     equ 0008h
SP5BRGL_SP5BRGL_LENGTH                   equ 0008h
SP5BRGL_SP5BRGL_MASK                     equ 00FFh

// Register: SP5BRGH
#define SP5BRGH SP5BRGH
SP5BRGH                                  equ 0EDFh
// bitfield definitions
SP5BRGH_SP5BRGH_POSN                     equ 0000h
SP5BRGH_SP5BRGH_POSITION                 equ 0000h
SP5BRGH_SP5BRGH_SIZE                     equ 0008h
SP5BRGH_SP5BRGH_LENGTH                   equ 0008h
SP5BRGH_SP5BRGH_MASK                     equ 00FFh

// Register: RC5STA
#define RC5STA RC5STA
RC5STA                                   equ 0EE0h
// bitfield definitions
RC5STA_RX9D_POSN                         equ 0000h
RC5STA_RX9D_POSITION                     equ 0000h
RC5STA_RX9D_SIZE                         equ 0001h
RC5STA_RX9D_LENGTH                       equ 0001h
RC5STA_RX9D_MASK                         equ 0001h
RC5STA_OERR_POSN                         equ 0001h
RC5STA_OERR_POSITION                     equ 0001h
RC5STA_OERR_SIZE                         equ 0001h
RC5STA_OERR_LENGTH                       equ 0001h
RC5STA_OERR_MASK                         equ 0002h
RC5STA_FERR_POSN                         equ 0002h
RC5STA_FERR_POSITION                     equ 0002h
RC5STA_FERR_SIZE                         equ 0001h
RC5STA_FERR_LENGTH                       equ 0001h
RC5STA_FERR_MASK                         equ 0004h
RC5STA_ADDEN_POSN                        equ 0003h
RC5STA_ADDEN_POSITION                    equ 0003h
RC5STA_ADDEN_SIZE                        equ 0001h
RC5STA_ADDEN_LENGTH                      equ 0001h
RC5STA_ADDEN_MASK                        equ 0008h
RC5STA_CREN_POSN                         equ 0004h
RC5STA_CREN_POSITION                     equ 0004h
RC5STA_CREN_SIZE                         equ 0001h
RC5STA_CREN_LENGTH                       equ 0001h
RC5STA_CREN_MASK                         equ 0010h
RC5STA_SREN_POSN                         equ 0005h
RC5STA_SREN_POSITION                     equ 0005h
RC5STA_SREN_SIZE                         equ 0001h
RC5STA_SREN_LENGTH                       equ 0001h
RC5STA_SREN_MASK                         equ 0020h
RC5STA_RX9_POSN                          equ 0006h
RC5STA_RX9_POSITION                      equ 0006h
RC5STA_RX9_SIZE                          equ 0001h
RC5STA_RX9_LENGTH                        equ 0001h
RC5STA_RX9_MASK                          equ 0040h
RC5STA_SPEN_POSN                         equ 0007h
RC5STA_SPEN_POSITION                     equ 0007h
RC5STA_SPEN_SIZE                         equ 0001h
RC5STA_SPEN_LENGTH                       equ 0001h
RC5STA_SPEN_MASK                         equ 0080h

// Register: TX5STA
#define TX5STA TX5STA
TX5STA                                   equ 0EE1h
// bitfield definitions
TX5STA_TX9D_POSN                         equ 0000h
TX5STA_TX9D_POSITION                     equ 0000h
TX5STA_TX9D_SIZE                         equ 0001h
TX5STA_TX9D_LENGTH                       equ 0001h
TX5STA_TX9D_MASK                         equ 0001h
TX5STA_TRMT_POSN                         equ 0001h
TX5STA_TRMT_POSITION                     equ 0001h
TX5STA_TRMT_SIZE                         equ 0001h
TX5STA_TRMT_LENGTH                       equ 0001h
TX5STA_TRMT_MASK                         equ 0002h
TX5STA_BRGH_POSN                         equ 0002h
TX5STA_BRGH_POSITION                     equ 0002h
TX5STA_BRGH_SIZE                         equ 0001h
TX5STA_BRGH_LENGTH                       equ 0001h
TX5STA_BRGH_MASK                         equ 0004h
TX5STA_SENDB_POSN                        equ 0003h
TX5STA_SENDB_POSITION                    equ 0003h
TX5STA_SENDB_SIZE                        equ 0001h
TX5STA_SENDB_LENGTH                      equ 0001h
TX5STA_SENDB_MASK                        equ 0008h
TX5STA_SYNC_POSN                         equ 0004h
TX5STA_SYNC_POSITION                     equ 0004h
TX5STA_SYNC_SIZE                         equ 0001h
TX5STA_SYNC_LENGTH                       equ 0001h
TX5STA_SYNC_MASK                         equ 0010h
TX5STA_TXEN_POSN                         equ 0005h
TX5STA_TXEN_POSITION                     equ 0005h
TX5STA_TXEN_SIZE                         equ 0001h
TX5STA_TXEN_LENGTH                       equ 0001h
TX5STA_TXEN_MASK                         equ 0020h
TX5STA_TX9_POSN                          equ 0006h
TX5STA_TX9_POSITION                      equ 0006h
TX5STA_TX9_SIZE                          equ 0001h
TX5STA_TX9_LENGTH                        equ 0001h
TX5STA_TX9_MASK                          equ 0040h
TX5STA_CSRC_POSN                         equ 0007h
TX5STA_CSRC_POSITION                     equ 0007h
TX5STA_CSRC_SIZE                         equ 0001h
TX5STA_CSRC_LENGTH                       equ 0001h
TX5STA_CSRC_MASK                         equ 0080h

// Register: BAUD5CON
#define BAUD5CON BAUD5CON
BAUD5CON                                 equ 0EE2h
// bitfield definitions
BAUD5CON_ABDEN_POSN                      equ 0000h
BAUD5CON_ABDEN_POSITION                  equ 0000h
BAUD5CON_ABDEN_SIZE                      equ 0001h
BAUD5CON_ABDEN_LENGTH                    equ 0001h
BAUD5CON_ABDEN_MASK                      equ 0001h
BAUD5CON_WUE_POSN                        equ 0001h
BAUD5CON_WUE_POSITION                    equ 0001h
BAUD5CON_WUE_SIZE                        equ 0001h
BAUD5CON_WUE_LENGTH                      equ 0001h
BAUD5CON_WUE_MASK                        equ 0002h
BAUD5CON_BRG16_POSN                      equ 0003h
BAUD5CON_BRG16_POSITION                  equ 0003h
BAUD5CON_BRG16_SIZE                      equ 0001h
BAUD5CON_BRG16_LENGTH                    equ 0001h
BAUD5CON_BRG16_MASK                      equ 0008h
BAUD5CON_SCKP_POSN                       equ 0004h
BAUD5CON_SCKP_POSITION                   equ 0004h
BAUD5CON_SCKP_SIZE                       equ 0001h
BAUD5CON_SCKP_LENGTH                     equ 0001h
BAUD5CON_SCKP_MASK                       equ 0010h
BAUD5CON_RCIDL_POSN                      equ 0006h
BAUD5CON_RCIDL_POSITION                  equ 0006h
BAUD5CON_RCIDL_SIZE                      equ 0001h
BAUD5CON_RCIDL_LENGTH                    equ 0001h
BAUD5CON_RCIDL_MASK                      equ 0040h
BAUD5CON_ABDOVF_POSN                     equ 0007h
BAUD5CON_ABDOVF_POSITION                 equ 0007h
BAUD5CON_ABDOVF_SIZE                     equ 0001h
BAUD5CON_ABDOVF_LENGTH                   equ 0001h
BAUD5CON_ABDOVF_MASK                     equ 0080h

// Register: RC4REG
#define RC4REG RC4REG
RC4REG                                   equ 0EE3h
// bitfield definitions
RC4REG_RC4REG_POSN                       equ 0000h
RC4REG_RC4REG_POSITION                   equ 0000h
RC4REG_RC4REG_SIZE                       equ 0008h
RC4REG_RC4REG_LENGTH                     equ 0008h
RC4REG_RC4REG_MASK                       equ 00FFh

