GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k40.inc
// Register: SP3BRGL
#define SP3BRGL SP3BRGL
SP3BRGL                                  equ 0EECh
// bitfield definitions
SP3BRGL_SP3BRGL_POSN                     equ 0000h
SP3BRGL_SP3BRGL_POSITION                 equ 0000h
SP3BRGL_SP3BRGL_SIZE                     equ 0008h
SP3BRGL_SP3BRGL_LENGTH                   equ 0008h
SP3BRGL_SP3BRGL_MASK                     equ 00FFh

// Register: SP3BRGH
#define SP3BRGH SP3BRGH
SP3BRGH                                  equ 0EEDh
// bitfield definitions
SP3BRGH_SP3BRGH_POSN                     equ 0000h
SP3BRGH_SP3BRGH_POSITION                 equ 0000h
SP3BRGH_SP3BRGH_SIZE                     equ 0008h
SP3BRGH_SP3BRGH_LENGTH                   equ 0008h
SP3BRGH_SP3BRGH_MASK                     equ 00FFh

// Register: RC3STA
#define RC3STA RC3STA
RC3STA                                   equ 0EEEh
// bitfield definitions
RC3STA_RX9D_POSN                         equ 0000h
RC3STA_RX9D_POSITION                     equ 0000h
RC3STA_RX9D_SIZE                         equ 0001h
RC3STA_RX9D_LENGTH                       equ 0001h
RC3STA_RX9D_MASK                         equ 0001h
RC3STA_OERR_POSN                         equ 0001h
RC3STA_OERR_POSITION                     equ 0001h
RC3STA_OERR_SIZE                         equ 0001h
RC3STA_OERR_LENGTH                       equ 0001h
RC3STA_OERR_MASK                         equ 0002h
RC3STA_FERR_POSN                         equ 0002h
RC3STA_FERR_POSITION                     equ 0002h
RC3STA_FERR_SIZE                         equ 0001h
RC3STA_FERR_LENGTH                       equ 0001h
RC3STA_FERR_MASK                         equ 0004h
RC3STA_ADDEN_POSN                        equ 0003h
RC3STA_ADDEN_POSITION                    equ 0003h
RC3STA_ADDEN_SIZE                        equ 0001h
RC3STA_ADDEN_LENGTH                      equ 0001h
RC3STA_ADDEN_MASK                        equ 0008h
RC3STA_CREN_POSN                         equ 0004h
RC3STA_CREN_POSITION                     equ 0004h
RC3STA_CREN_SIZE                         equ 0001h
RC3STA_CREN_LENGTH                       equ 0001h
RC3STA_CREN_MASK                         equ 0010h
RC3STA_SREN_POSN                         equ 0005h
RC3STA_SREN_POSITION                     equ 0005h
RC3STA_SREN_SIZE                         equ 0001h
RC3STA_SREN_LENGTH                       equ 0001h
RC3STA_SREN_MASK                         equ 0020h
RC3STA_RX9_POSN                          equ 0006h
RC3STA_RX9_POSITION                      equ 0006h
RC3STA_RX9_SIZE                          equ 0001h
RC3STA_RX9_LENGTH                        equ 0001h
RC3STA_RX9_MASK                          equ 0040h
RC3STA_SPEN_POSN                         equ 0007h
RC3STA_SPEN_POSITION                     equ 0007h
RC3STA_SPEN_SIZE                         equ 0001h
RC3STA_SPEN_LENGTH                       equ 0001h
RC3STA_SPEN_MASK                         equ 0080h

// Register: TX3STA
#define TX3STA TX3STA
TX3STA                                   equ 0EEFh
// bitfield definitions
TX3STA_TX9D_POSN                         equ 0000h
TX3STA_TX9D_POSITION                     equ 0000h
TX3STA_TX9D_SIZE                         equ 0001h
TX3STA_TX9D_LENGTH                       equ 0001h
TX3STA_TX9D_MASK                         equ 0001h
TX3STA_TRMT_POSN                         equ 0001h
TX3STA_TRMT_POSITION                     equ 0001h
TX3STA_TRMT_SIZE                         equ 0001h
TX3STA_TRMT_LENGTH                       equ 0001h
TX3STA_TRMT_MASK                         equ 0002h
TX3STA_BRGH_POSN                         equ 0002h
TX3STA_BRGH_POSITION                     equ 0002h
TX3STA_BRGH_SIZE                         equ 0001h
TX3STA_BRGH_LENGTH                       equ 0001h
TX3STA_BRGH_MASK                         equ 0004h
TX3STA_SENDB_POSN                        equ 0003h
TX3STA_SENDB_POSITION                    equ 0003h
TX3STA_SENDB_SIZE                        equ 0001h
TX3STA_SENDB_LENGTH                      equ 0001h
TX3STA_SENDB_MASK                        equ 0008h
TX3STA_SYNC_POSN                         equ 0004h
TX3STA_SYNC_POSITION                     equ 0004h
TX3STA_SYNC_SIZE                         equ 0001h
TX3STA_SYNC_LENGTH                       equ 0001h
TX3STA_SYNC_MASK                         equ 0010h
TX3STA_TXEN_POSN                         equ 0005h
TX3STA_TXEN_POSITION                     equ 0005h
TX3STA_TXEN_SIZE                         equ 0001h
TX3STA_TXEN_LENGTH                       equ 0001h
TX3STA_TXEN_MASK                         equ 0020h
TX3STA_TX9_POSN                          equ 0006h
TX3STA_TX9_POSITION                      equ 0006h
TX3STA_TX9_SIZE                          equ 0001h
TX3STA_TX9_LENGTH                        equ 0001h
TX3STA_TX9_MASK                          equ 0040h
TX3STA_CSRC_POSN                         equ 0007h
TX3STA_CSRC_POSITION                     equ 0007h
TX3STA_CSRC_SIZE                         equ 0001h
TX3STA_CSRC_LENGTH                       equ 0001h
TX3STA_CSRC_MASK                         equ 0080h

// Register: BAUD3CON
#define BAUD3CON BAUD3CON
BAUD3CON                                 equ 0EF0h
// bitfield definitions
BAUD3CON_ABDEN_POSN                      equ 0000h
BAUD3CON_ABDEN_POSITION                  equ 0000h
BAUD3CON_ABDEN_SIZE                      equ 0001h
BAUD3CON_ABDEN_LENGTH                    equ 0001h
BAUD3CON_ABDEN_MASK                      equ 0001h
BAUD3CON_WUE_POSN                        equ 0001h
BAUD3CON_WUE_POSITION                    equ 0001h
BAUD3CON_WUE_SIZE                        equ 0001h
BAUD3CON_WUE_LENGTH                      equ 0001h
BAUD3CON_WUE_MASK                        equ 0002h
BAUD3CON_BRG16_POSN                      equ 0003h
BAUD3CON_BRG16_POSITION                  equ 0003h
BAUD3CON_BRG16_SIZE                      equ 0001h
BAUD3CON_BRG16_LENGTH                    equ 0001h
BAUD3CON_BRG16_MASK                      equ 0008h
BAUD3CON_SCKP_POSN                       equ 0004h
BAUD3CON_SCKP_POSITION                   equ 0004h
BAUD3CON_SCKP_SIZE                       equ 0001h
BAUD3CON_SCKP_LENGTH                     equ 0001h
BAUD3CON_SCKP_MASK                       equ 0010h
BAUD3CON_RCIDL_POSN                      equ 0006h
BAUD3CON_RCIDL_POSITION                  equ 0006h
BAUD3CON_RCIDL_SIZE                      equ 0001h
BAUD3CON_RCIDL_LENGTH                    equ 0001h
BAUD3CON_RCIDL_MASK                      equ 0040h
BAUD3CON_ABDOVF_POSN                     equ 0007h
BAUD3CON_ABDOVF_POSITION                 equ 0007h
BAUD3CON_ABDOVF_SIZE                     equ 0001h
BAUD3CON_ABDOVF_LENGTH                   equ 0001h
BAUD3CON_ABDOVF_MASK                     equ 0080h

// Register: RC2REG
#define RC2REG RC2REG
RC2REG                                   equ 0EF1h
// bitfield definitions
RC2REG_RC2REG_POSN                       equ 0000h
RC2REG_RC2REG_POSITION                   equ 0000h
RC2REG_RC2REG_SIZE                       equ 0008h
RC2REG_RC2REG_LENGTH                     equ 0008h
RC2REG_RC2REG_MASK                       equ 00FFh

