GopalSaraf/Practicals/PSDL/include/proc/pic18lf66k40.inc
// Register: BAUD1CON
#define BAUD1CON BAUD1CON
BAUD1CON                                 equ 0F9Eh
// bitfield definitions
BAUD1CON_ABDEN_POSN                      equ 0000h
BAUD1CON_ABDEN_POSITION                  equ 0000h
BAUD1CON_ABDEN_SIZE                      equ 0001h
BAUD1CON_ABDEN_LENGTH                    equ 0001h
BAUD1CON_ABDEN_MASK                      equ 0001h
BAUD1CON_WUE_POSN                        equ 0001h
BAUD1CON_WUE_POSITION                    equ 0001h
BAUD1CON_WUE_SIZE                        equ 0001h
BAUD1CON_WUE_LENGTH                      equ 0001h
BAUD1CON_WUE_MASK                        equ 0002h
BAUD1CON_BRG16_POSN                      equ 0003h
BAUD1CON_BRG16_POSITION                  equ 0003h
BAUD1CON_BRG16_SIZE                      equ 0001h
BAUD1CON_BRG16_LENGTH                    equ 0001h
BAUD1CON_BRG16_MASK                      equ 0008h
BAUD1CON_SCKP_POSN                       equ 0004h
BAUD1CON_SCKP_POSITION                   equ 0004h
BAUD1CON_SCKP_SIZE                       equ 0001h
BAUD1CON_SCKP_LENGTH                     equ 0001h
BAUD1CON_SCKP_MASK                       equ 0010h
BAUD1CON_RCIDL_POSN                      equ 0006h
BAUD1CON_RCIDL_POSITION                  equ 0006h
BAUD1CON_RCIDL_SIZE                      equ 0001h
BAUD1CON_RCIDL_LENGTH                    equ 0001h
BAUD1CON_RCIDL_MASK                      equ 0040h
BAUD1CON_ABDOVF_POSN                     equ 0007h
BAUD1CON_ABDOVF_POSITION                 equ 0007h
BAUD1CON_ABDOVF_SIZE                     equ 0001h
BAUD1CON_ABDOVF_LENGTH                   equ 0001h
BAUD1CON_ABDOVF_MASK                     equ 0080h
BAUD1CON_ABDEN1_POSN                     equ 0000h
BAUD1CON_ABDEN1_POSITION                 equ 0000h
BAUD1CON_ABDEN1_SIZE                     equ 0001h
BAUD1CON_ABDEN1_LENGTH                   equ 0001h
BAUD1CON_ABDEN1_MASK                     equ 0001h
BAUD1CON_ABDOVF1_POSN                    equ 0007h
BAUD1CON_ABDOVF1_POSITION                equ 0007h
BAUD1CON_ABDOVF1_SIZE                    equ 0001h
BAUD1CON_ABDOVF1_LENGTH                  equ 0001h
BAUD1CON_ABDOVF1_MASK                    equ 0080h
BAUD1CON_BRG161_POSN                     equ 0003h
BAUD1CON_BRG161_POSITION                 equ 0003h
BAUD1CON_BRG161_SIZE                     equ 0001h
BAUD1CON_BRG161_LENGTH                   equ 0001h
BAUD1CON_BRG161_MASK                     equ 0008h
BAUD1CON_CKTXP_POSN                      equ 0004h
BAUD1CON_CKTXP_POSITION                  equ 0004h
BAUD1CON_CKTXP_SIZE                      equ 0001h
BAUD1CON_CKTXP_LENGTH                    equ 0001h
BAUD1CON_CKTXP_MASK                      equ 0010h
BAUD1CON_RCIDL1_POSN                     equ 0006h
BAUD1CON_RCIDL1_POSITION                 equ 0006h
BAUD1CON_RCIDL1_SIZE                     equ 0001h
BAUD1CON_RCIDL1_LENGTH                   equ 0001h
BAUD1CON_RCIDL1_MASK                     equ 0040h
BAUD1CON_RCMT_POSN                       equ 0006h
BAUD1CON_RCMT_POSITION                   equ 0006h
BAUD1CON_RCMT_SIZE                       equ 0001h
BAUD1CON_RCMT_LENGTH                     equ 0001h
BAUD1CON_RCMT_MASK                       equ 0040h
BAUD1CON_RCMT1_POSN                      equ 0006h
BAUD1CON_RCMT1_POSITION                  equ 0006h
BAUD1CON_RCMT1_SIZE                      equ 0001h
BAUD1CON_RCMT1_LENGTH                    equ 0001h
BAUD1CON_RCMT1_MASK                      equ 0040h
BAUD1CON_SCKP1_POSN                      equ 0004h
BAUD1CON_SCKP1_POSITION                  equ 0004h
BAUD1CON_SCKP1_SIZE                      equ 0001h
BAUD1CON_SCKP1_LENGTH                    equ 0001h
BAUD1CON_SCKP1_MASK                      equ 0010h
BAUD1CON_TXCKP_POSN                      equ 0004h
BAUD1CON_TXCKP_POSITION                  equ 0004h
BAUD1CON_TXCKP_SIZE                      equ 0001h
BAUD1CON_TXCKP_LENGTH                    equ 0001h
BAUD1CON_TXCKP_MASK                      equ 0010h
BAUD1CON_TXCKP1_POSN                     equ 0004h
BAUD1CON_TXCKP1_POSITION                 equ 0004h
BAUD1CON_TXCKP1_SIZE                     equ 0001h
BAUD1CON_TXCKP1_LENGTH                   equ 0001h
BAUD1CON_TXCKP1_MASK                     equ 0010h
BAUD1CON_WUE1_POSN                       equ 0001h
BAUD1CON_WUE1_POSITION                   equ 0001h
BAUD1CON_WUE1_SIZE                       equ 0001h
BAUD1CON_WUE1_LENGTH                     equ 0001h
BAUD1CON_WUE1_MASK                       equ 0002h
BAUD1CON_W4E_POSN                        equ 0001h
BAUD1CON_W4E_POSITION                    equ 0001h
BAUD1CON_W4E_SIZE                        equ 0001h
BAUD1CON_W4E_LENGTH                      equ 0001h
BAUD1CON_W4E_MASK                        equ 0002h

// Register: PWM7DC
#define PWM7DC PWM7DC
PWM7DC                                   equ 0F9Fh

// Register: PWM7DCL
#define PWM7DCL PWM7DCL
PWM7DCL                                  equ 0F9Fh
// bitfield definitions
PWM7DCL_DC_POSN                          equ 0006h
PWM7DCL_DC_POSITION                      equ 0006h
PWM7DCL_DC_SIZE                          equ 0002h
PWM7DCL_DC_LENGTH                        equ 0002h
PWM7DCL_DC_MASK                          equ 00C0h
PWM7DCL_DC0_POSN                         equ 0006h
PWM7DCL_DC0_POSITION                     equ 0006h
PWM7DCL_DC0_SIZE                         equ 0001h
PWM7DCL_DC0_LENGTH                       equ 0001h
PWM7DCL_DC0_MASK                         equ 0040h
PWM7DCL_DC1_POSN                         equ 0007h
PWM7DCL_DC1_POSITION                     equ 0007h
PWM7DCL_DC1_SIZE                         equ 0001h
PWM7DCL_DC1_LENGTH                       equ 0001h
PWM7DCL_DC1_MASK                         equ 0080h
PWM7DCL_PWM7DC0_POSN                     equ 0006h
PWM7DCL_PWM7DC0_POSITION                 equ 0006h
PWM7DCL_PWM7DC0_SIZE                     equ 0001h
PWM7DCL_PWM7DC0_LENGTH                   equ 0001h
PWM7DCL_PWM7DC0_MASK                     equ 0040h
PWM7DCL_PWM7DC1_POSN                     equ 0007h
PWM7DCL_PWM7DC1_POSITION                 equ 0007h
PWM7DCL_PWM7DC1_SIZE                     equ 0001h
PWM7DCL_PWM7DC1_LENGTH                   equ 0001h
PWM7DCL_PWM7DC1_MASK                     equ 0080h
PWM7DCL_PWMPW0_POSN                      equ 0006h
PWM7DCL_PWMPW0_POSITION                  equ 0006h
PWM7DCL_PWMPW0_SIZE                      equ 0001h
PWM7DCL_PWMPW0_LENGTH                    equ 0001h
PWM7DCL_PWMPW0_MASK                      equ 0040h
PWM7DCL_PWMPW1_POSN                      equ 0007h
PWM7DCL_PWMPW1_POSITION                  equ 0007h
PWM7DCL_PWMPW1_SIZE                      equ 0001h
PWM7DCL_PWMPW1_LENGTH                    equ 0001h
PWM7DCL_PWMPW1_MASK                      equ 0080h

// Register: PWM7DCH
#define PWM7DCH PWM7DCH
PWM7DCH                                  equ 0FA0h
// bitfield definitions
PWM7DCH_DC_POSN                          equ 0000h
PWM7DCH_DC_POSITION                      equ 0000h
PWM7DCH_DC_SIZE                          equ 0008h
PWM7DCH_DC_LENGTH                        equ 0008h
PWM7DCH_DC_MASK                          equ 00FFh
PWM7DCH_DC2_POSN                         equ 0000h
PWM7DCH_DC2_POSITION                     equ 0000h
PWM7DCH_DC2_SIZE                         equ 0001h
PWM7DCH_DC2_LENGTH                       equ 0001h
PWM7DCH_DC2_MASK                         equ 0001h
PWM7DCH_DC3_POSN                         equ 0001h
PWM7DCH_DC3_POSITION                     equ 0001h
PWM7DCH_DC3_SIZE                         equ 0001h
PWM7DCH_DC3_LENGTH                       equ 0001h
PWM7DCH_DC3_MASK                         equ 0002h
PWM7DCH_DC4_POSN                         equ 0002h
PWM7DCH_DC4_POSITION                     equ 0002h
PWM7DCH_DC4_SIZE                         equ 0001h
PWM7DCH_DC4_LENGTH                       equ 0001h
PWM7DCH_DC4_MASK                         equ 0004h
PWM7DCH_DC5_POSN                         equ 0003h
PWM7DCH_DC5_POSITION                     equ 0003h
PWM7DCH_DC5_SIZE                         equ 0001h
PWM7DCH_DC5_LENGTH                       equ 0001h
PWM7DCH_DC5_MASK                         equ 0008h
PWM7DCH_DC6_POSN                         equ 0004h
PWM7DCH_DC6_POSITION                     equ 0004h
PWM7DCH_DC6_SIZE                         equ 0001h
PWM7DCH_DC6_LENGTH                       equ 0001h
PWM7DCH_DC6_MASK                         equ 0010h
PWM7DCH_DC7_POSN                         equ 0005h
PWM7DCH_DC7_POSITION                     equ 0005h
PWM7DCH_DC7_SIZE                         equ 0001h
PWM7DCH_DC7_LENGTH                       equ 0001h
PWM7DCH_DC7_MASK                         equ 0020h
PWM7DCH_DC8_POSN                         equ 0006h
PWM7DCH_DC8_POSITION                     equ 0006h
PWM7DCH_DC8_SIZE                         equ 0001h
PWM7DCH_DC8_LENGTH                       equ 0001h
PWM7DCH_DC8_MASK                         equ 0040h
PWM7DCH_DC9_POSN                         equ 0007h
PWM7DCH_DC9_POSITION                     equ 0007h
PWM7DCH_DC9_SIZE                         equ 0001h
PWM7DCH_DC9_LENGTH                       equ 0001h
PWM7DCH_DC9_MASK                         equ 0080h
PWM7DCH_PWM7DC2_POSN                     equ 0000h
PWM7DCH_PWM7DC2_POSITION                 equ 0000h
PWM7DCH_PWM7DC2_SIZE                     equ 0001h
PWM7DCH_PWM7DC2_LENGTH                   equ 0001h
PWM7DCH_PWM7DC2_MASK                     equ 0001h
PWM7DCH_PWM7DC3_POSN                     equ 0001h
PWM7DCH_PWM7DC3_POSITION                 equ 0001h
PWM7DCH_PWM7DC3_SIZE                     equ 0001h
PWM7DCH_PWM7DC3_LENGTH                   equ 0001h
PWM7DCH_PWM7DC3_MASK                     equ 0002h
PWM7DCH_PWM7DC4_POSN                     equ 0002h
PWM7DCH_PWM7DC4_POSITION                 equ 0002h
PWM7DCH_PWM7DC4_SIZE                     equ 0001h
PWM7DCH_PWM7DC4_LENGTH                   equ 0001h
PWM7DCH_PWM7DC4_MASK                     equ 0004h
PWM7DCH_PWM7DC5_POSN                     equ 0003h
PWM7DCH_PWM7DC5_POSITION                 equ 0003h
PWM7DCH_PWM7DC5_SIZE                     equ 0001h
PWM7DCH_PWM7DC5_LENGTH                   equ 0001h
PWM7DCH_PWM7DC5_MASK                     equ 0008h
PWM7DCH_PWM7DC6_POSN                     equ 0004h
PWM7DCH_PWM7DC6_POSITION                 equ 0004h
PWM7DCH_PWM7DC6_SIZE                     equ 0001h
PWM7DCH_PWM7DC6_LENGTH                   equ 0001h
PWM7DCH_PWM7DC6_MASK                     equ 0010h
PWM7DCH_PWM7DC7_POSN                     equ 0005h
PWM7DCH_PWM7DC7_POSITION                 equ 0005h
PWM7DCH_PWM7DC7_SIZE                     equ 0001h
PWM7DCH_PWM7DC7_LENGTH                   equ 0001h
PWM7DCH_PWM7DC7_MASK                     equ 0020h
PWM7DCH_PWM7DC8_POSN                     equ 0006h
PWM7DCH_PWM7DC8_POSITION                 equ 0006h
PWM7DCH_PWM7DC8_SIZE                     equ 0001h
PWM7DCH_PWM7DC8_LENGTH                   equ 0001h
PWM7DCH_PWM7DC8_MASK                     equ 0040h
PWM7DCH_PWM7DC9_POSN                     equ 0007h
PWM7DCH_PWM7DC9_POSITION                 equ 0007h
PWM7DCH_PWM7DC9_SIZE                     equ 0001h
PWM7DCH_PWM7DC9_LENGTH                   equ 0001h
PWM7DCH_PWM7DC9_MASK                     equ 0080h
PWM7DCH_PWMPW2_POSN                      equ 0000h
PWM7DCH_PWMPW2_POSITION                  equ 0000h
PWM7DCH_PWMPW2_SIZE                      equ 0001h
PWM7DCH_PWMPW2_LENGTH                    equ 0001h
PWM7DCH_PWMPW2_MASK                      equ 0001h
PWM7DCH_PWMPW3_POSN                      equ 0001h
PWM7DCH_PWMPW3_POSITION                  equ 0001h
PWM7DCH_PWMPW3_SIZE                      equ 0001h
PWM7DCH_PWMPW3_LENGTH                    equ 0001h
PWM7DCH_PWMPW3_MASK                      equ 0002h
PWM7DCH_PWMPW4_POSN                      equ 0002h
PWM7DCH_PWMPW4_POSITION                  equ 0002h
PWM7DCH_PWMPW4_SIZE                      equ 0001h
PWM7DCH_PWMPW4_LENGTH                    equ 0001h
PWM7DCH_PWMPW4_MASK                      equ 0004h
PWM7DCH_PWMPW5_POSN                      equ 0003h
PWM7DCH_PWMPW5_POSITION                  equ 0003h
PWM7DCH_PWMPW5_SIZE                      equ 0001h
PWM7DCH_PWMPW5_LENGTH                    equ 0001h
PWM7DCH_PWMPW5_MASK                      equ 0008h
PWM7DCH_PWMPW6_POSN                      equ 0004h
PWM7DCH_PWMPW6_POSITION                  equ 0004h
PWM7DCH_PWMPW6_SIZE                      equ 0001h
PWM7DCH_PWMPW6_LENGTH                    equ 0001h
PWM7DCH_PWMPW6_MASK                      equ 0010h
PWM7DCH_PWMPW7_POSN                      equ 0005h
PWM7DCH_PWMPW7_POSITION                  equ 0005h
PWM7DCH_PWMPW7_SIZE                      equ 0001h
PWM7DCH_PWMPW7_LENGTH                    equ 0001h
PWM7DCH_PWMPW7_MASK                      equ 0020h
PWM7DCH_PWMPW8_POSN                      equ 0006h
PWM7DCH_PWMPW8_POSITION                  equ 0006h
PWM7DCH_PWMPW8_SIZE                      equ 0001h
PWM7DCH_PWMPW8_LENGTH                    equ 0001h
PWM7DCH_PWMPW8_MASK                      equ 0040h
PWM7DCH_PWMPW9_POSN                      equ 0007h
PWM7DCH_PWMPW9_POSITION                  equ 0007h
PWM7DCH_PWMPW9_SIZE                      equ 0001h
PWM7DCH_PWMPW9_LENGTH                    equ 0001h
PWM7DCH_PWMPW9_MASK                      equ 0080h

// Register: PWM7CON
#define PWM7CON PWM7CON
PWM7CON                                  equ 0FA1h
// bitfield definitions
PWM7CON_POL_POSN                         equ 0004h
PWM7CON_POL_POSITION                     equ 0004h
PWM7CON_POL_SIZE                         equ 0001h
PWM7CON_POL_LENGTH                       equ 0001h
PWM7CON_POL_MASK                         equ 0010h
PWM7CON_OUT_POSN                         equ 0005h
PWM7CON_OUT_POSITION                     equ 0005h
PWM7CON_OUT_SIZE                         equ 0001h
PWM7CON_OUT_LENGTH                       equ 0001h
PWM7CON_OUT_MASK                         equ 0020h
PWM7CON_OE_POSN                          equ 0006h
PWM7CON_OE_POSITION                      equ 0006h
PWM7CON_OE_SIZE                          equ 0001h
PWM7CON_OE_LENGTH                        equ 0001h
PWM7CON_OE_MASK                          equ 0040h
PWM7CON_EN_POSN                          equ 0007h
PWM7CON_EN_POSITION                      equ 0007h
PWM7CON_EN_SIZE                          equ 0001h
PWM7CON_EN_LENGTH                        equ 0001h
PWM7CON_EN_MASK                          equ 0080h
PWM7CON_PWM7POL_POSN                     equ 0004h
PWM7CON_PWM7POL_POSITION                 equ 0004h
PWM7CON_PWM7POL_SIZE                     equ 0001h
PWM7CON_PWM7POL_LENGTH                   equ 0001h
PWM7CON_PWM7POL_MASK                     equ 0010h
PWM7CON_PWM7OUT_POSN                     equ 0005h
PWM7CON_PWM7OUT_POSITION                 equ 0005h
PWM7CON_PWM7OUT_SIZE                     equ 0001h
PWM7CON_PWM7OUT_LENGTH                   equ 0001h
PWM7CON_PWM7OUT_MASK                     equ 0020h
PWM7CON_PWM7OE_POSN                      equ 0006h
PWM7CON_PWM7OE_POSITION                  equ 0006h
PWM7CON_PWM7OE_SIZE                      equ 0001h
PWM7CON_PWM7OE_LENGTH                    equ 0001h
PWM7CON_PWM7OE_MASK                      equ 0040h
PWM7CON_PWM7EN_POSN                      equ 0007h
PWM7CON_PWM7EN_POSITION                  equ 0007h
PWM7CON_PWM7EN_SIZE                      equ 0001h
PWM7CON_PWM7EN_LENGTH                    equ 0001h
PWM7CON_PWM7EN_MASK                      equ 0080h

// Register: PWM6DC
#define PWM6DC PWM6DC
PWM6DC                                   equ 0FA2h

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
PWM6DCL                                  equ 0FA2h
// bitfield definitions
PWM6DCL_DC_POSN                          equ 0006h
PWM6DCL_DC_POSITION                      equ 0006h
PWM6DCL_DC_SIZE                          equ 0002h
PWM6DCL_DC_LENGTH                        equ 0002h
PWM6DCL_DC_MASK                          equ 00C0h
PWM6DCL_DC0_POSN                         equ 0006h
PWM6DCL_DC0_POSITION                     equ 0006h
PWM6DCL_DC0_SIZE                         equ 0001h
PWM6DCL_DC0_LENGTH                       equ 0001h
PWM6DCL_DC0_MASK                         equ 0040h
PWM6DCL_DC1_POSN                         equ 0007h
PWM6DCL_DC1_POSITION                     equ 0007h
PWM6DCL_DC1_SIZE                         equ 0001h
PWM6DCL_DC1_LENGTH                       equ 0001h
PWM6DCL_DC1_MASK                         equ 0080h
PWM6DCL_PWM6DC0_POSN                     equ 0006h
PWM6DCL_PWM6DC0_POSITION                 equ 0006h
PWM6DCL_PWM6DC0_SIZE                     equ 0001h
PWM6DCL_PWM6DC0_LENGTH                   equ 0001h
PWM6DCL_PWM6DC0_MASK                     equ 0040h
PWM6DCL_PWM6DC1_POSN                     equ 0007h
PWM6DCL_PWM6DC1_POSITION                 equ 0007h
PWM6DCL_PWM6DC1_SIZE                     equ 0001h
PWM6DCL_PWM6DC1_LENGTH                   equ 0001h
PWM6DCL_PWM6DC1_MASK                     equ 0080h
PWM6DCL_PWMPW0_POSN                      equ 0006h
PWM6DCL_PWMPW0_POSITION                  equ 0006h
PWM6DCL_PWMPW0_SIZE                      equ 0001h
PWM6DCL_PWMPW0_LENGTH                    equ 0001h
PWM6DCL_PWMPW0_MASK                      equ 0040h
PWM6DCL_PWMPW1_POSN                      equ 0007h
PWM6DCL_PWMPW1_POSITION                  equ 0007h
PWM6DCL_PWMPW1_SIZE                      equ 0001h
PWM6DCL_PWMPW1_LENGTH                    equ 0001h
PWM6DCL_PWMPW1_MASK                      equ 0080h

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
PWM6DCH                                  equ 0FA3h
// bitfield definitions
PWM6DCH_DC_POSN                          equ 0000h
PWM6DCH_DC_POSITION                      equ 0000h
PWM6DCH_DC_SIZE                          equ 0008h
PWM6DCH_DC_LENGTH                        equ 0008h
PWM6DCH_DC_MASK                          equ 00FFh
PWM6DCH_DC2_POSN                         equ 0000h
PWM6DCH_DC2_POSITION                     equ 0000h
PWM6DCH_DC2_SIZE                         equ 0001h
PWM6DCH_DC2_LENGTH                       equ 0001h
PWM6DCH_DC2_MASK                         equ 0001h
PWM6DCH_DC3_POSN                         equ 0001h
PWM6DCH_DC3_POSITION                     equ 0001h
PWM6DCH_DC3_SIZE                         equ 0001h
PWM6DCH_DC3_LENGTH                       equ 0001h
PWM6DCH_DC3_MASK                         equ 0002h
PWM6DCH_DC4_POSN                         equ 0002h
PWM6DCH_DC4_POSITION                     equ 0002h
PWM6DCH_DC4_SIZE                         equ 0001h
PWM6DCH_DC4_LENGTH                       equ 0001h
PWM6DCH_DC4_MASK                         equ 0004h
PWM6DCH_DC5_POSN                         equ 0003h
PWM6DCH_DC5_POSITION                     equ 0003h
PWM6DCH_DC5_SIZE                         equ 0001h
PWM6DCH_DC5_LENGTH                       equ 0001h
PWM6DCH_DC5_MASK                         equ 0008h
PWM6DCH_DC6_POSN                         equ 0004h
PWM6DCH_DC6_POSITION                     equ 0004h
PWM6DCH_DC6_SIZE                         equ 0001h
PWM6DCH_DC6_LENGTH                       equ 0001h
PWM6DCH_DC6_MASK                         equ 0010h
PWM6DCH_DC7_POSN                         equ 0005h
PWM6DCH_DC7_POSITION                     equ 0005h
PWM6DCH_DC7_SIZE                         equ 0001h
PWM6DCH_DC7_LENGTH                       equ 0001h
PWM6DCH_DC7_MASK                         equ 0020h
PWM6DCH_DC8_POSN                         equ 0006h
PWM6DCH_DC8_POSITION                     equ 0006h
PWM6DCH_DC8_SIZE                         equ 0001h
PWM6DCH_DC8_LENGTH                       equ 0001h
PWM6DCH_DC8_MASK                         equ 0040h
PWM6DCH_DC9_POSN                         equ 0007h
PWM6DCH_DC9_POSITION                     equ 0007h
PWM6DCH_DC9_SIZE                         equ 0001h
PWM6DCH_DC9_LENGTH                       equ 0001h
PWM6DCH_DC9_MASK                         equ 0080h
PWM6DCH_PWM6DC2_POSN                     equ 0000h
PWM6DCH_PWM6DC2_POSITION                 equ 0000h
PWM6DCH_PWM6DC2_SIZE                     equ 0001h
PWM6DCH_PWM6DC2_LENGTH                   equ 0001h
PWM6DCH_PWM6DC2_MASK                     equ 0001h
PWM6DCH_PWM6DC3_POSN                     equ 0001h
PWM6DCH_PWM6DC3_POSITION                 equ 0001h
PWM6DCH_PWM6DC3_SIZE                     equ 0001h
PWM6DCH_PWM6DC3_LENGTH                   equ 0001h
PWM6DCH_PWM6DC3_MASK                     equ 0002h
PWM6DCH_PWM6DC4_POSN                     equ 0002h
PWM6DCH_PWM6DC4_POSITION                 equ 0002h
PWM6DCH_PWM6DC4_SIZE                     equ 0001h
PWM6DCH_PWM6DC4_LENGTH                   equ 0001h
PWM6DCH_PWM6DC4_MASK                     equ 0004h
PWM6DCH_PWM6DC5_POSN                     equ 0003h
PWM6DCH_PWM6DC5_POSITION                 equ 0003h
PWM6DCH_PWM6DC5_SIZE                     equ 0001h
PWM6DCH_PWM6DC5_LENGTH                   equ 0001h
PWM6DCH_PWM6DC5_MASK                     equ 0008h
PWM6DCH_PWM6DC6_POSN                     equ 0004h
PWM6DCH_PWM6DC6_POSITION                 equ 0004h
PWM6DCH_PWM6DC6_SIZE                     equ 0001h
PWM6DCH_PWM6DC6_LENGTH                   equ 0001h
PWM6DCH_PWM6DC6_MASK                     equ 0010h
PWM6DCH_PWM6DC7_POSN                     equ 0005h
PWM6DCH_PWM6DC7_POSITION                 equ 0005h
PWM6DCH_PWM6DC7_SIZE                     equ 0001h
PWM6DCH_PWM6DC7_LENGTH                   equ 0001h
PWM6DCH_PWM6DC7_MASK                     equ 0020h
PWM6DCH_PWM6DC8_POSN                     equ 0006h
PWM6DCH_PWM6DC8_POSITION                 equ 0006h
PWM6DCH_PWM6DC8_SIZE                     equ 0001h
PWM6DCH_PWM6DC8_LENGTH                   equ 0001h
PWM6DCH_PWM6DC8_MASK                     equ 0040h
PWM6DCH_PWM6DC9_POSN                     equ 0007h
PWM6DCH_PWM6DC9_POSITION                 equ 0007h
PWM6DCH_PWM6DC9_SIZE                     equ 0001h
PWM6DCH_PWM6DC9_LENGTH                   equ 0001h
PWM6DCH_PWM6DC9_MASK                     equ 0080h
PWM6DCH_PWMPW2_POSN                      equ 0000h
PWM6DCH_PWMPW2_POSITION                  equ 0000h
PWM6DCH_PWMPW2_SIZE                      equ 0001h
PWM6DCH_PWMPW2_LENGTH                    equ 0001h
PWM6DCH_PWMPW2_MASK                      equ 0001h
PWM6DCH_PWMPW3_POSN                      equ 0001h
PWM6DCH_PWMPW3_POSITION                  equ 0001h
PWM6DCH_PWMPW3_SIZE                      equ 0001h
PWM6DCH_PWMPW3_LENGTH                    equ 0001h
PWM6DCH_PWMPW3_MASK                      equ 0002h
PWM6DCH_PWMPW4_POSN                      equ 0002h
PWM6DCH_PWMPW4_POSITION                  equ 0002h
PWM6DCH_PWMPW4_SIZE                      equ 0001h
PWM6DCH_PWMPW4_LENGTH                    equ 0001h
PWM6DCH_PWMPW4_MASK                      equ 0004h
PWM6DCH_PWMPW5_POSN                      equ 0003h
PWM6DCH_PWMPW5_POSITION                  equ 0003h
PWM6DCH_PWMPW5_SIZE                      equ 0001h
PWM6DCH_PWMPW5_LENGTH                    equ 0001h
PWM6DCH_PWMPW5_MASK                      equ 0008h
PWM6DCH_PWMPW6_POSN                      equ 0004h
PWM6DCH_PWMPW6_POSITION                  equ 0004h
PWM6DCH_PWMPW6_SIZE                      equ 0001h
PWM6DCH_PWMPW6_LENGTH                    equ 0001h
PWM6DCH_PWMPW6_MASK                      equ 0010h
PWM6DCH_PWMPW7_POSN                      equ 0005h
PWM6DCH_PWMPW7_POSITION                  equ 0005h
PWM6DCH_PWMPW7_SIZE                      equ 0001h
PWM6DCH_PWMPW7_LENGTH                    equ 0001h
PWM6DCH_PWMPW7_MASK                      equ 0020h
PWM6DCH_PWMPW8_POSN                      equ 0006h
PWM6DCH_PWMPW8_POSITION                  equ 0006h
PWM6DCH_PWMPW8_SIZE                      equ 0001h
PWM6DCH_PWMPW8_LENGTH                    equ 0001h
PWM6DCH_PWMPW8_MASK                      equ 0040h
PWM6DCH_PWMPW9_POSN                      equ 0007h
PWM6DCH_PWMPW9_POSITION                  equ 0007h
PWM6DCH_PWMPW9_SIZE                      equ 0001h
PWM6DCH_PWMPW9_LENGTH                    equ 0001h
PWM6DCH_PWMPW9_MASK                      equ 0080h

